{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "16-eToF-Spectra", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 1000], "dtype": "float32", "sparse": false, "name": "16-eToF-Spectra"}, "inbound_nodes": []}, {"name": "lambda", "class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAUAAABDAAAAcxYAAAB8AGQAZACFAnwBZABkAIUCZgMZAFMAKQFOqQApAtoG\naW5wdXRz2gFpcgEAAAByAQAAAPoePGlweXRob24taW5wdXQtMi05MzQ0NmI3MTU1ZWI+2gZzbGlj\nZXIJAAAAcwIAAAAAAg==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"i": 15}}, "inbound_nodes": [[["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]], [["16-eToF-Spectra", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1000, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda", 0, 0, {}]], [["lambda", 1, 0, {}]], [["lambda", 2, 0, {}]], [["lambda", 3, 0, {}]], [["lambda", 4, 0, {}]], [["lambda", 5, 0, {}]], [["lambda", 6, 0, {}]], [["lambda", 7, 0, {}]], [["lambda", 8, 0, {}]], [["lambda", 9, 0, {}]], [["lambda", 10, 0, {}]], [["lambda", 11, 0, {}]], [["lambda", 12, 0, {}]], [["lambda", 13, 0, {}]], [["lambda", 14, 0, {}]], [["lambda", 15, 0, {}]]]}, {"name": "concatenate", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense", 0, 0, {}], ["dense", 1, 0, {}], ["dense", 2, 0, {}], ["dense", 3, 0, {}], ["dense", 4, 0, {}], ["dense", 5, 0, {}], ["dense", 6, 0, {}], ["dense", 7, 0, {}], ["dense", 8, 0, {}], ["dense", 9, 0, {}], ["dense", 10, 0, {}], ["dense", 11, 0, {}], ["dense", 12, 0, {}], ["dense", 13, 0, {}], ["dense", 14, 0, {}], ["dense", 15, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1000, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 1000, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 1000, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "real", "class_name": "Dense", "config": {"name": "real", "trainable": true, "dtype": "float32", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "input_layers": [["16-eToF-Spectra", 0, 0]], "output_layers": [["real", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}